import os

# 配置文件
# 列定义
"""
账单列定义
来源：支付宝、微信、京东
交易时间：
交易类型：交通出行、餐饮美食、投资理财、生活开支、日用百货、文化休闲、鞋帽服饰、消费还款、其他
 - 交通出行：打车、公交、地铁、燃油、火车等
 - 餐饮美食：三餐、零食、聚餐
 - 投资理财：基金、股票，改行后续剔除，专门做一个投资表格
 - 生活日用：洗漱用品、护肤精华、厨卫用品、生活电器、超市购物、水电燃气费、电话费、宽带费、租房
 - 鞋帽服饰：衣服、鞋子、行李箱、背包、袜子
 - 文化休闲：书籍、游戏、博物馆
 - 数码电子：手机电脑游戏机、相机、镜头
 - 消费还款：花呗、招商信用卡、白条
 - 其他：
 - 待人工确认：
类型细化：预留后续精细化
交易对方：商家名称
商品：商品名称或说明
交易状态：交易成功、交易失败、待定
交易方式：花呗、信用卡、现金、其他
收/支：收入、支出、不计收支、待定
金额：

支付宝映射：
    0：新增来源支付宝
    1：0
    2：1
    3：待定
    4：2
    5：4
    6：8
    7：7
    8：5
    9：6
微信映射：
    0：新增来源微信
    1：0
    2：1
    3：待定
    4：2
    5：3
    6：7
    7：6
    8：4
    9：5

京东映射：
    0：新增来源京东
    1：0
    2：1
    3：待定
    4：2
    5：3
    6：7
    7：6
    8：4
    9：5
"""
BILL_COLUMNS = [
    '来源','交易时间', '交易类型', '类型细化', '交易对方', 
    '商品', '交易状态', '交易方式','收/支', '金额'
]


# 映射表
EXPENSE_MAPPING = {
    '收入': '收入',  
    '支出': '支出',  
    '不计收支': '不计收支', 
    '待定': '待定'
}

TRANSACTION_STATUS_MAPPING = {
    '交易成功': '交易成功',  
    '交易失败': '交易失败',
    '待定': '待定'  
}

# 默认值
DEFAULT_EXPENSE = '待定'
DEFAULT_TRANSACTION_STATUS = '待定'

# 文件路径配置
ROOT_DIR = os.path.dirname(os.path.abspath(__file__))
INIT_BILL_PATH = os.path.join(ROOT_DIR, "初始账单", "25年01月份")
OUTPUT_DIR = os.path.join(ROOT_DIR, "账单", "25年01月份整理")
SAVE_PATH = os.path.join(OUTPUT_DIR, "25_01_total_bill.xlsx")

# 格式定义
FORMAT_STR = '%Y-%m-%d %H:%M:%S'

# 统一交易类型列
KEYWORD_RULES = {
    "餐饮美食": ["肉", "餐饮", "餐", "食", "饭", "菜", "面", "饼", "粥", "汤", "饮品", "饮料", "果汁", "奶茶", "冰", "甜品"],
    "日用百货": ["日用", "百货", "家居", "生活", "用品", "清洁", "洗护", "纸巾", "卫生", "塑料", "陶瓷"],
    "鞋帽服饰": ["衣", "服", "裤", "帽", "鞋", "袜", "围巾", "手套", "皮带", "包包"],
    "文化休闲": ["书", "图书", "杂志", "文具", "笔", "画", "艺术", "乐器", "电影", "演出", "展览", "旅游"],
    "生活开支": ["水费", "电费", "燃气", "物业", "宽带", "电话", "手机", "宽带", "通信", "维修"],
    "交通出行": ["交通", "打车", "地铁", "公交", "火车", "飞机", "租车", "油费", "过路费", "停车"],
    "投资理财": ["理财", "基金", "股票", "存款", "保险", "贷款", "利息", "投资", "债券", "金融"],
    "消费还款": ["还款", "信用卡", "花呗", "白条", "分期", "借款", "还贷", "欠款"],
    "其他": ["未知", "其他", "杂项", "未分类"]
}

# 统一交易状态
## 映射表
TRANSACTION_STATUS_MAP = {
    "支付成功": "交易成功",
    "已转账": "交易成功",
    "对方已收钱": "交易成功",
    "交易成功": "交易成功",
    "已存入零钱": "交易成功",
    "交易失败": "交易失败",
    "退款成功": "交易失败",
    "交易关闭": "交易失败"
}